SALES DATASET

In [10]:
import pandas as pd 
import numpy as np

In [14]:
df = pd.read_csv("sales_data.CSV")

In [22]:
print("Shape of Dataset:",df.shape)

Shape of Dataset: (1000, 14)

In [20]:
print("First 5 rows of dataset:",df.head())

,Product_ID,Sale_Date,Sales_Rep,Region,Sales_Amount,Quantity_Sold,Product_Category,Unit_Cost,Unit_Price,Customer_Type,Discount,Payment_Method,Sales_Channel,Region_and_Sales_Rep
0,1052,2023-02-03,Bob,North,5053.97,18,Furniture,152.75,267.22,Returning,0.09,Cash,Online,North-Bob
1,1093,2023-04-21,Bob,West,4384.02,17,Furniture,3816.39,4209.44,Returning,0.11,Cash,Retail,West-Bob
2,1015,2023-09-21,David,South,4631.23,30,Food,261.56,371.40,Returning,0.20,Bank Transfer,Retail,South-David
3,1072,2023-08-24,Bob,South,2167.94,39,Clothing,4330.03,4467.75,New,0.02,Credit Card,Retail,South-Bob
4,1061,2023-03-24,Charlie,East,3750.20,13,Electronics,637.37,692.71,New,0.08,Credit Card,Online,East-Charlie

In [24]:
print("Column names:\n",df.columns)

Column names:
 Index(['Product_ID', 'Sale_Date', 'Sales_Rep', 'Region', 'Sales_Amount',
       'Quantity_Sold', 'Product_Category', 'Unit_Cost', 'Unit_Price',
       'Customer_Type', 'Discount', 'Payment_Method', 'Sales_Channel',
       'Region_and_Sales_Rep'],
      dtype='object')

In [26]:
print("Data Types:\n",df.dtypes)

Data Types:
 Product_ID                int64
Sale_Date                object
Sales_Rep                object
Region                   object
Sales_Amount            float64
Quantity_Sold             int64
Product_Category         object
Unit_Cost               float64
Unit_Price              float64
Customer_Type            object
Discount                float64
Payment_Method           object
Sales_Channel            object
Region_and_Sales_Rep     object
dtype: object

In [28]:
print("Missing Values:\n",df.isnull().sum())

Missing Values:
 Product_ID              0
Sale_Date               0
Sales_Rep               0
Region                  0
Sales_Amount            0
Quantity_Sold           0
Product_Category        0
Unit_Cost               0
Unit_Price              0
Customer_Type           0
Discount                0
Payment_Method          0
Sales_Channel           0
Region_and_Sales_Rep    0
dtype: int64

In [32]:
print("Duplicate rows:\n",df.duplicated().sum())

Duplicate rows:
 0

In [38]:
#removing duplicate rows

df.drop_duplicates(inplace=True)

In [40]:
df.describe()

,Product_ID,Sales_Amount,Quantity_Sold,Unit_Cost,Unit_Price,Discount
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.00000
mean,1050.128000,5019.265230,25.355000,2475.304550,2728.440120,0.15239
std,29.573505,2846.790126,14.159006,1417.872546,1419.399839,0.08720
min,1001.000000,100.120000,1.000000,60.280000,167.120000,0.00000
25%,1024.000000,2550.297500,13.000000,1238.380000,1509.085000,0.08000
50%,1051.000000,5019.300000,25.000000,2467.235000,2696.400000,0.15000
75%,1075.000000,7507.445000,38.000000,3702.865000,3957.970000,0.23000
max,1100.000000,9989.040000,49.000000,4995.300000,5442.150000,0.30000

In [44]:
txt_columns = df.select_dtypes(include='object').columns
for col in txt_columns:
    df[col] = df[col].str.strip().str.lower()

In [48]:
df.columns

Index(['Product_ID', 'Sale_Date', 'Sales_Rep', 'Region', 'Sales_Amount',
       'Quantity_Sold', 'Product_Category', 'Unit_Cost', 'Unit_Price',
       'Customer_Type', 'Discount', 'Payment_Method', 'Sales_Channel',
       'Region_and_Sales_Rep'],
      dtype='object')

In [50]:
df.Region

0      north
1       west
2      south
3      south
4       east
       ...
995    north
996    north
997    south
998     west
999     east
Name: Region, Length: 1000, dtype: object

In [52]:
df['Region'] = df['Region'].replace({'north':'norrthh'})#changoing col name

In [54]:
df.Region

0      norrthh
1         west
2        south
3        south
4         east
        ...
995    norrthh
996    norrthh
997      south
998       west
999       east
Name: Region, Length: 1000, dtype: object

In [56]:
if 'Sale_Date' in df.columns:
    df['Sale_Date'] = pd.to_datetime(df['Sale_Date'], errors='coerce')

In [58]:
df.Sale_Date

0     2023-02-03
1     2023-04-21
2     2023-09-21
3     2023-08-24
4     2023-03-24
         ...
995   2023-04-15
996   2023-09-07
997   2023-04-27
998   2023-12-20
999   2023-08-16
Name: Sale_Date, Length: 1000, dtype: datetime64[ns]

In [60]:
df.columns = df.columns.str.strip().str.lower().str.replace('','_')

In [62]:
df.columns

Index(['_p_r_o_d_u_c_t___i_d_', '_s_a_l_e___d_a_t_e_', '_s_a_l_e_s___r_e_p_',
       '_r_e_g_i_o_n_', '_s_a_l_e_s___a_m_o_u_n_t_',
       '_q_u_a_n_t_i_t_y___s_o_l_d_', '_p_r_o_d_u_c_t___c_a_t_e_g_o_r_y_',
       '_u_n_i_t___c_o_s_t_', '_u_n_i_t___p_r_i_c_e_',
       '_c_u_s_t_o_m_e_r___t_y_p_e_', '_d_i_s_c_o_u_n_t_',
       '_p_a_y_m_e_n_t___m_e_t_h_o_d_', '_s_a_l_e_s___c_h_a_n_n_e_l_',
       '_r_e_g_i_o_n___a_n_d___s_a_l_e_s___r_e_p_'],
      dtype='object')

In [64]:
df.describe()

,_p_r_o_d_u_c_t___i_d_,_s_a_l_e___d_a_t_e_,_s_a_l_e_s___a_m_o_u_n_t_,_q_u_a_n_t_i_t_y___s_o_l_d_,_u_n_i_t___c_o_s_t_,_u_n_i_t___p_r_i_c_e_,_d_i_s_c_o_u_n_t_
count,1000.000000,1000,1000.000000,1000.000000,1000.000000,1000.000000,1000.00000
mean,1050.128000,2023-07-02 17:42:43.199999744,5019.265230,25.355000,2475.304550,2728.440120,0.15239
min,1001.000000,2023-01-01 00:00:00,100.120000,1.000000,60.280000,167.120000,0.00000
25%,1024.000000,2023-03-30 00:00:00,2550.297500,13.000000,1238.380000,1509.085000,0.08000
50%,1051.000000,2023-06-30 12:00:00,5019.300000,25.000000,2467.235000,2696.400000,0.15000
75%,1075.000000,2023-10-12 00:00:00,7507.445000,38.000000,3702.865000,3957.970000,0.23000
max,1100.000000,2024-01-01 00:00:00,9989.040000,49.000000,4995.300000,5442.150000,0.30000
std,29.573505,NaN,2846.790126,14.159006,1417.872546,1419.399839,0.08720

In [66]:
print("AFTER CLEANING THE DATASET:\n")
print(df.info())

AFTER CLEANING THE DATASET:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
 #   Column                                     Non-Null Count  Dtype
---  ------                                     --------------  -----
 0   _p_r_o_d_u_c_t___i_d_                      1000 non-null   int64
 1   _s_a_l_e___d_a_t_e_                        1000 non-null   datetime64[ns]
 2   _s_a_l_e_s___r_e_p_                        1000 non-null   object
 3   _r_e_g_i_o_n_                              1000 non-null   object
 4   _s_a_l_e_s___a_m_o_u_n_t_                  1000 non-null   float64
 5   _q_u_a_n_t_i_t_y___s_o_l_d_                1000 non-null   int64
 6   _p_r_o_d_u_c_t___c_a_t_e_g_o_r_y_          1000 non-null   object
 7   _u_n_i_t___c_o_s_t_                        1000 non-null   float64
 8   _u_n_i_t___p_r_i_c_e_                      1000 non-null   float64
 9   _c_u_s_t_o_m_e_r___t_y_p_e_                1000 non-null   object
 10  _d_i_s_c_o_u_n_t_                          1000 non-null   float64
 11  _p_a_y_m_e_n_t___m_e_t_h_o_d_              1000 non-null   object
 12  _s_a_l_e_s___c_h_a_n_n_e_l_                1000 non-null   object
 13  _r_e_g_i_o_n___a_n_d___s_a_l_e_s___r_e_p_  1000 non-null   object
dtypes: datetime64[ns](1), float64(4), int64(2), object(7)
memory usage: 109.5+ KB
None

In [68]:
print("Missing values after cleaning:\n",df.isnull().sum())

Missing values after cleaning:
 _p_r_o_d_u_c_t___i_d_                        0
_s_a_l_e___d_a_t_e_                          0
_s_a_l_e_s___r_e_p_                          0
_r_e_g_i_o_n_                                0
_s_a_l_e_s___a_m_o_u_n_t_                    0
_q_u_a_n_t_i_t_y___s_o_l_d_                  0
_p_r_o_d_u_c_t___c_a_t_e_g_o_r_y_            0
_u_n_i_t___c_o_s_t_                          0
_u_n_i_t___p_r_i_c_e_                        0
_c_u_s_t_o_m_e_r___t_y_p_e_                  0
_d_i_s_c_o_u_n_t_                            0
_p_a_y_m_e_n_t___m_e_t_h_o_d_                0
_s_a_l_e_s___c_h_a_n_n_e_l_                  0
_r_e_g_i_o_n___a_n_d___s_a_l_e_s___r_e_p_    0
dtype: int64

In [70]:
print("Duplicate rows after cleaning:",df.duplicated().sum())

Duplicate rows after cleaning: 0

In [72]:
#saving the cleaned dataset
df.to_csv("Sales_data_cleaned.csv", index=False)
print("Cleaned dataset saved as 'Sales_data_cleaned.csv'")

Cleaned dataset saved as 'Sales_data_cleaned.csv'